app/views/users/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."user_id" = ?  [["user_id", 9]]
---
    </h2><br/>
    <% current_user.comments.reverse.each do |comment|%>