app/views/pictures/show.html.erb

SELECT "tags".* FROM "tags" INNER JOIN "picture_tags" ON "tags"."id" = "picture_tags"."tag_id" WHERE "picture_tags"."picture_id" = ?  [["picture_id", 1]]
---
<h2><%= @picture.title %></h2>
<% @picture.tags.each do |tag| %>

SELECT "comments".* FROM "comments" WHERE "comments"."picture_id" = ?  [["picture_id", 2]]
---

<% @picture.comments.each do |comment| %>