app/controllers/comments_controller.rb

INSERT INTO "comments" ("content", "user_id", "picture_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "Soothing"], ["user_id", 9], ["picture_id", 14], ["created_at", "2017-05-10 15:56:01.323592"], ["updated_at", "2017-05-10 15:56:01.323592"]]
---
  def create
    @comment = Comment.new(comment_params)
    @comment.user_id = @current_user.id
    @comment.picture_id = params[:id]
    @comment.save