app/controllers/pictures_controller.rb

INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "Rick"], ["created_at", "2017-05-10 21:47:39.631243"], ["updated_at", "2017-05-10 21:47:39.631243"]]
SELECT  "tags".* FROM "tags" WHERE "tags"."name" = ? LIMIT ?  [["name", "Rick"], ["LIMIT", 1]]
INSERT INTO "picture_tags" ("picture_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["picture_id", 29], ["tag_id", 20], ["created_at", "2017-05-11 13:02:39.146977"], ["updated_at", "2017-05-11 13:02:39.146977"]]
INSERT INTO "pictures" ("id", "image_url", "title", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
 def create
   @tags = params[:picture][:tags].split(',')
   @picture = Picture.new(picture_params)
   @picture.user_id = current_user.id
   @tags.each do |tags|
     tag = Tag.find_or_create_by(name: tags)
     @picture.tags << tag

SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "pictures" SET "title" = ?, "updated_at" = ? WHERE "pictures"."id" = ?  [["title", "Saw a funny looking fish!"], ["updated_at", "2017-05-09 21:26:11.628630"], ["id", 1]]
---
 def update
   @picture = Picture.find(params[:id])
   @picture.update(picture_params)