app/controllers/tags_controller.rb

  def create
    @tag = Tag.find_or_create_by(name: tag_params[:name])
    @picture = Picture.find(params[:picture_id])
    @picture.tags << @tag
---
INSERT INTO "tags" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "fro"], ["created_at", "2017-05-10 18:55:38.339331"], ["updated_at", "2017-05-10 18:55:38.339331"]]
SELECT  "pictures".* FROM "pictures" WHERE "pictures"."id" = ? LIMIT ?  [["id", nil], ["LIMIT", 1]]
INSERT INTO "picture_tags" ("picture_id", "tag_id", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["picture_id", 1], ["tag_id", 10], ["created_at", "2017-05-10 19:09:40.974230"], ["updated_at", "2017-05-10 19:09:40.974230"]]